adamkondraciuk/nrfx/mdk/iar_startup_nrf7140_radiocore.s
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     TIMER132_IRQHandler
        DCD     TIMER133_IRQHandler
        DCD     PWM131_IRQHandler
        DCD     SERIAL2_IRQHandler
        DCD     SERIAL3_IRQHandler
        DCD     PDM131_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     TIMER134_IRQHandler
        DCD     TIMER135_IRQHandler
        DCD     PWM132_IRQHandler
        DCD     SERIAL4_IRQHandler
        DCD     SERIAL5_IRQHandler
        DCD     PDM132_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     TIMER136_IRQHandler
        DCD     TIMER137_IRQHandler
        DCD     PWM133_IRQHandler
        DCD     SERIAL6_IRQHandler
        DCD     SERIAL7_IRQHandler
        DCD     PDM133_IRQHandler
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved
        DCD     0                         ; Reserved

__Vectors_End
__Vectors                           EQU   __vector_table
__Vectors_Size                      EQU   __Vectors_End - __Vectors


; Default handlers.
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler

        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        ; Dummy exception handlers


        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemoryManagement_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemoryManagement_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SecureFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SecureFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .


       ; Dummy interrupt handlers

        PUBWEAK  SPU000_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU000_IRQHandler
        B .

        PUBWEAK  MPC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MPC_IRQHandler
        B .

        PUBWEAK  CPUC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CPUC_IRQHandler
        B .

        PUBWEAK  MVDMA_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA_IRQHandler
        B .

        PUBWEAK  SPU010_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU010_IRQHandler
        B .

        PUBWEAK  WDT010_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT010_IRQHandler
        B .

        PUBWEAK  WDT011_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
WDT011_IRQHandler
        B .

        PUBWEAK  SPU020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU020_IRQHandler
        B .

        PUBWEAK  EGU020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EGU020_IRQHandler
        B .

        PUBWEAK  AAR020_CCM020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR020_CCM020_IRQHandler
        B .

        PUBWEAK  GPIOTE_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE_0_IRQHandler
        B .

        PUBWEAK  TIMER020_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER020_IRQHandler
        B .

        PUBWEAK  TIMER021_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER021_IRQHandler
        B .

        PUBWEAK  TIMER022_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER022_IRQHandler
        B .

        PUBWEAK  RTC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RTC_IRQHandler
        B .

        PUBWEAK  RADIO_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIO_0_IRQHandler
        B .

        PUBWEAK  RADIO_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIO_1_IRQHandler
        B .

        PUBWEAK  SPU030_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPU030_IRQHandler
        B .

        PUBWEAK  RADIOACC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
RADIOACC_IRQHandler
        B .

        PUBWEAK  VPR_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR_IRQHandler
        B .

