adamkondraciuk/nrfx/mdk/iar_startup_nrf7140_radiocore.s
        PUBWEAK  AAR030_CCM030_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR030_CCM030_IRQHandler
        B .

        PUBWEAK  ECB030_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ECB030_IRQHandler
        B .

        PUBWEAK  AAR031_CCM031_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
AAR031_CCM031_IRQHandler
        B .

        PUBWEAK  ECB031_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
ECB031_IRQHandler
        B .

        PUBWEAK  IPCT_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_0_IRQHandler
        B .

        PUBWEAK  IPCT_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT_1_IRQHandler
        B .

        PUBWEAK  SWI0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI0_IRQHandler
        B .

        PUBWEAK  SWI1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI1_IRQHandler
        B .

        PUBWEAK  SWI2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI2_IRQHandler
        B .

        PUBWEAK  SWI3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI3_IRQHandler
        B .

        PUBWEAK  SWI4_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI4_IRQHandler
        B .

        PUBWEAK  SWI5_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI5_IRQHandler
        B .

        PUBWEAK  SWI6_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI6_IRQHandler
        B .

        PUBWEAK  SWI7_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SWI7_IRQHandler
        B .

        PUBWEAK  BELLBOARD_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_0_IRQHandler
        B .

        PUBWEAK  BELLBOARD_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_1_IRQHandler
        B .

        PUBWEAK  BELLBOARD_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_2_IRQHandler
        B .

        PUBWEAK  BELLBOARD_3_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
BELLBOARD_3_IRQHandler
        B .

        PUBWEAK  GPIOTE130_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_0_IRQHandler
        B .

        PUBWEAK  GPIOTE130_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOTE130_1_IRQHandler
        B .

        PUBWEAK  GRTC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_0_IRQHandler
        B .

        PUBWEAK  GRTC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_1_IRQHandler
        B .

        PUBWEAK  GRTC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GRTC_2_IRQHandler
        B .

        PUBWEAK  GSI_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GSI_IRQHandler
        B .

        PUBWEAK  DISPC_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
DISPC_0_IRQHandler
        B .

        PUBWEAK  DISPC_1_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
DISPC_1_IRQHandler
        B .

        PUBWEAK  DISPC_2_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
DISPC_2_IRQHandler
        B .

        PUBWEAK  GPU_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPU_IRQHandler
        B .

        PUBWEAK  TBM_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TBM_IRQHandler
        B .

        PUBWEAK  USBHS_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
USBHS_IRQHandler
        B .

        PUBWEAK  MRAMC110_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC110_IRQHandler
        B .

        PUBWEAK  MRAMC111_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MRAMC111_IRQHandler
        B .

        PUBWEAK  EXMIF_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
EXMIF_IRQHandler
        B .

        PUBWEAK  OTPC_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
OTPC_IRQHandler
        B .

        PUBWEAK  VPR120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR120_IRQHandler
        B .

        PUBWEAK  IPCT120_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
IPCT120_0_IRQHandler
        B .

        PUBWEAK  I3C120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C120_IRQHandler
        B .

        PUBWEAK  VPR121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR121_IRQHandler
        B .

        PUBWEAK  QSPI120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QSPI120_IRQHandler
        B .

        PUBWEAK  CAN120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CAN120_IRQHandler
        B .

        PUBWEAK  MVDMA120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA120_IRQHandler
        B .

        PUBWEAK  CAN121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
CAN121_IRQHandler
        B .

        PUBWEAK  MVDMA121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
MVDMA121_IRQHandler
        B .

        PUBWEAK  I3C121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
I3C121_IRQHandler
        B .

        PUBWEAK  QSPI121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
QSPI121_IRQHandler
        B .

        PUBWEAK  TIMER120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER120_IRQHandler
        B .

        PUBWEAK  TIMER121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER121_IRQHandler
        B .

        PUBWEAK  PWM120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM120_IRQHandler
        B .

        PUBWEAK  SPIS120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIS120_IRQHandler
        B .

        PUBWEAK  SPIM120_UARTE120_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM120_UARTE120_IRQHandler
        B .

        PUBWEAK  SPIM121_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM121_IRQHandler
        B .

        PUBWEAK  SPIM122_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM122_IRQHandler
        B .

        PUBWEAK  SPIM123_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
SPIM123_IRQHandler
        B .

        PUBWEAK  VPR130_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
VPR130_IRQHandler
        B .

